Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Quarkus provides the ability to limit test execution to tests with specific `@TestProfile` annotations. This works by leveraging the `tags` method of `QuarkusTestProfile` in conjunction with the `quarkus.test.profile.tags` system property.
zh_cn: Quarkus提供了将测试限制在具有特定 `@TestProfile` 注释的测试中执行的能力。这是通过联合利用 `QuarkusTestProfile` 的 `tags` 方法和 `quarkus.test.profile.tags` 系统属性来实现的。

source: Quarkus provides various configuration knobs under the `quarkus.spring-cloud-config` root. For the purposes of this guide, our Quarkus application is going to be configured in `application.properties` as follows:
zh_cn: Quarkus在 `quarkus.spring-cloud-config` 根路径下提供了多种配置选项。就该指南而言，我们的Quarkus应用程序将在 `application.properties` 中配置以下内容:

source: Quarkus should automatically discover this implementation and use it instead of the default implementation discussed earlier.
zh_cn: Quarkus应该自动发现这个实现并使用它，而不是前面讨论的默认实现。

source: Quarkus simplifies things by allowing extensions authors to simply register a `RuntimeInitializedClassBuildItem`. A simple example of doing so could be:
zh_cn: Quarkus通过允许扩展作者简单地注册一个 `RuntimeInitializedClassBuildItem` 来简化操作。这样做的一个简单例子是：

source: Quarkus specific configuration
zh_cn: Quarkus的特定配置

source: Quarkus starts a AMQP broker automatically, configures the application and shares the broker instance between different applications. See xref:amqp-dev-services.adoc[Dev Services for AMQP] for more details.
zh_cn: Quarkus会自动启动一个AMQP代理，配置应用程序，并在不同的应用程序之间共享代理实例。要了解更多的细节，请参阅 xref:amqp-dev-services.adoc[AMQP的开发服务] 。

source: Quarkus supports Continuous testing, but this is covered by the xref:continuous-testing.adoc[Continuous Testing Guide].
zh_cn: Quarkus支持持续测试，但这是 link:continuous-testing.html[持续测试指南] 所讨论的。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. What that means practically, is that if you have docker running and have not configured `quarkus.redis.hosts`, Quarkus will automatically start a Redis container when running tests or dev-mode, and automatically configure the connection.
zh_cn: Quarkus支持一项叫做Dev Services的功能，籍此，无需进行任何配置即可创建各种数据源。这意味着，如果你运行着docker服务，但没有配置 `quarkus.redis.hosts` ，Quarkus会在运行测试或dev模式时自动启动一个Redis容器，并自动配置连接。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. In the case of MongoDB this support extends to the default MongoDB connection. What that means practically, is that if you have not configured `quarkus.mongodb.connection-string` Quarkus will automatically start a MongoDB container when running tests or dev-mode, and automatically configure the connection.
zh_cn: Quarkus支持一种叫做Dev Services的功能，它允许你在没有任何配置的情况下创建各种数据源。在MongoDB的情况下，这种支持延伸到默认的MongoDB连接。也就是说，如果你没有配置 `quarkus.mongodb.connection-string` ，Quarkus会在运行测试或开发模式时自动启动一个MongoDB容器，并自动配置连接。

source: Quarkus supports both the `yml` and `yaml` file extensions.
zh_cn: Quarkus同时支持 `yml` 和 `yaml` 文件扩展名。

source: Quarkus supports https://junit.org/junit5/[JUnit 5] tests.
zh_cn: Quarkus支持 link:https://junit.org/junit5/[JUnit 5] 测试。

source: Quarkus supports the use of mock objects using two different approaches. You can either use CDI alternatives to mock out a bean for all test classes, or use `QuarkusMock` to mock out beans on a per test basis.
zh_cn: Quarkus支持使用两种不同的方法来mock对象。您可以使用CDI alternatives来mock出所有测试类的Bean，也可以使用 `QuarkusMock` 来mock出每个测试类的Bean。

source: Quarkus supports the use of property expressions in the `application.properties` file so to externalize the configuration of the tasks you should store the properties in the `application.properties` file and use the `fixedRateString`, `initialDelayString` params respectively.
zh_cn: Quarkus支持在 `application.properties` 文件中使用属性表达式，因此为了使任务的配置外部化，你应该在 `application.properties` 文件中，分别使用 `fixedRateString` , `initialDelayString` 参数存储属性。

source: Quarkus supports this by allowing you to inject CDI beans into your tests via the `@Inject` annotation (in fact, tests in Quarkus are full CDI beans, so you can use all CDI functionality). Let's create a simple test that tests the greeting service directly without using HTTP:
zh_cn: Quarkus支持这种方式。它允许使用 `@Inject` 注解来将CDI Bean注入您的测试中（事实上，Quarkus中的测试是完整的CDI Bean，所以您可以使用所有的CDI功能）。让我们创建一个简单的测试，直接测试greeting服务，而非使用HTTP：

source: Quarkus tailors your application for GraalVM and HotSpot. Amazingly fast boot time, incredibly low RSS memory (not just heap size!) offering near instant scale up and high density memory utilization in container orchestration platforms like Kubernetes. We use a technique we call compile time boot.
zh_cn: Quarkus为GraalVM和HotSpot定制你的应用程序。令人惊讶的快速启动时间，令人难以置信的低RSS内存（不仅仅是堆的大小！），在Kubernetes等容器协调平台中提供近乎即时的扩展和高密度的内存利用。我们使用一种我们称之为编译时启动的技术。

source: Quarkus takes care of registering the `CodecProvider` for you as a CDI bean of `@Singleton` scope.
zh_cn: Quarkus负责为你注册 `CodecProvider` ，作为 `@Singleton` 范围的CDI bean。

source: Quarkus utilizes <a href="https://opentracing.io/" target="_blank">OpenTracing</a> which is a vendor-agnostic API to help developers easily instrument tracing into their codebase. Distributed tracing helps pinpoint where failures occur and what causes poor performance. <a href="{{site.baseurl}}/guides/opentracing">Read the guide for more details.</a>
zh_cn: Quarkus 利用<a href="https://opentracing.io/" target="_blank">OpenTracing</a>，这是一个与供应商无关的 API，可帮助开发人员轻松地将跟踪功能纳入其代码库。分布式跟踪有助于确定故障发生的位置以及导致性能不佳的原因。 <a href="{{site.baseurl}}/guides/opentracing">阅读该指南以了解更多详情</a>

source: Quarkus utilizes the <a href="https://micrometer.io/" target="_blank">Micrometer</a> metrics library for runtime and application metrics. It provides a simple facade for the most popular monitoring systems to instrument your JVM-based application code without vendor lock-in. Application-specific and built-in metrics can be exposed using Micrometer. <a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">Read the guide for more details.</a>
zh_cn: Quarkus利用<a href="https://micrometer.io/" target="_blank">Micrometer</a>度量库来实现运行时和应用程序的度量。它为最流行的监控系统提供了一个简单的接口，以便在不锁定供应商的情况下对基于JVM的应用程序代码进行检测。<a href="{{site.baseurl}}/guides/micrometer#support-for-the-microprofile-metrics-api">阅读该指南以了解更多细节</a>

source: Quarkus was built from the ground up for Kubernetes making it easy to deploy applications without having to understand all of the complexities of the platform. Quarkus allows developers to automatically generate Kubernetes resources including building and deploying container images without having to manually create YAML files.
zh_cn: Quarkus是为Kubernetes建立的，使其能够轻松部署应用程序，而无需了解该平台的所有复杂性。Quarkus允许开发者自动生成Kubernetes资源，包括构建和部署容器镜像，而无需手动创建YAML文件。

source: Quarkus was created to enable Java developers to create applications for a modern, cloud-native world. Quarkus is a Kubernetes-native Java framework tailored for GraalVM and HotSpot, crafted from best-of-breed Java libraries and standards. The goal is to make Java the leading platform in Kubernetes and serverless environments while offering developers a framework to address a wider range of distributed application architectures.
zh_cn: Quarkus的创建是为了使Java开发人员能够为现代的、云原生的世界创建应用程序。Quarkus是一个为GraalVM和HotSpot定制的Kubernetes原生Java框架，由最佳的Java库和标准精心打造。其目标是使Java成为Kubernetes和无服务器环境的领先平台，同时为开发者提供一个框架，以解决更广泛的分布式应用架构问题。

source: Quarkus will automatically register all the classes annotated with `@BsonDiscriminator` with the POJO codec.
zh_cn: Quarkus 将使用 POJO codec自动注册所有使用 `@BsonDiscriminator` 的类。

source: Quarkus's Collaborative Community Forum
zh_cn: Quarkus的合作社区论坛

source: Quarkus's integration with lambdas also supports Quarkus's Live Coding development cycle. You an bring up your Quarkus lambda project in dev or test mode and code on your project live.
zh_cn: Quarkus与lambdas的集成也支持Quarkus的Live Coding开发周期。你可以在开发或测试模式下启动你的Quarkus lambda项目，并在项目中实时编码。

source: Quarkus.io Website Based on Jekyll
zh_cn: Quarkus.io网站基于Jekyll

source: Query debugging
zh_cn: 查询调试

source: Query parameters
zh_cn: 查询参数

source: Query projection
zh_cn: 查询映射

source: Query projection can be done with the `project(Class)` method on the `PanacheQuery` object that is returned by the `find()` methods.
zh_cn: 查询映射可以使用 `find()` 方法返回的 `PanacheQuery` 对象上的 `project(Class)` 方法来完成。

source: Quickly Bootstrap Your Application
zh_cn: 快速引导您的应用程序

source: Quickstart
zh_cn: 快速入门

source: Quickstarts URL common base prefix.
zh_cn: Quickstarts URL 通用基础前缀。

source: Quickstarts URL for git clone referenced by the documentation.
zh_cn: 文档所引用的git clone的Quickstarts URL。

source: Quickstarts URL to main blob source tree; used for referencing source files.
zh_cn: 指向主blob源树的Quickstarts URL；用于引用源文件。

source: Quickstarts URL to main source archive.
zh_cn: 指向主源存档的Quickstarts URL

source: Quickstarts URL to main source tree root; used for referencing directories.
zh_cn: 指向主源树根的Quickstarts URL；用于引用目录。

source: Quite often one only needs to create a native Linux executable for their Quarkus application (for example in order to run in a containerized environment) and would like to avoid the trouble of installing the proper GraalVM version in order to accomplish this task (for example, in CI environments it's common practice to install as little software as possible).
zh_cn: 很多时候，人们只需要为他们的Quarkus应用程序创建一个原生Linux可执行文件（例如，为了在容器化环境中运行），并希望避免安装适当的GraalVM版本来完成这项麻烦任务（例如，在CI环境中，通常的做法是尽可能少地安装软件）。

source: RESTEasy Reactive and its Jackson support to handle JSON payloads
zh_cn: RESTEasy Reactive和其Jackson支持来处理JSON有效载荷

source: RESTEasy Reactive is naturally integrated with Mutiny.
zh_cn: RESTEasy Reactive与Mutiny集成。

source: RESTEasy Reactive to serve HTTP requests
zh_cn: RESTEasy Reactive为HTTP请求提供服务

source: RSA Private Key PEM Content
zh_cn: RSA私钥PEM格式的内容

source: RSA Public Key PEM Content
zh_cn: RSA公钥PEM格式内容

source: RabbitMQ Client
zh_cn: RabbitMQ客户端

source: Re-augment a Quarkus Application
zh_cn: 重新增强Quarkus应用程序

source: Reactive
zh_cn: 响应式

source: Reactive Entities and Repositories
zh_cn: 响应式实体和存储库

source: Reactive Messaging
zh_cn: 响应式消息

source: Reactive Messaging AMQP 1.0 Connector Reference Documentation
zh_cn: 响应式消息AMQP 1.0连接器参考文档

source: Reactive Messaging _startup_ and _readiness_ checks offer two strategies. The default strategy verifies that an active connection is established with the broker. This approach is not intrusive as it's based on built-in Kafka client metrics.
zh_cn: 响应式消息传递的 _启动_ 和 _就绪_ 检查提供了两种策略。默认策略是确认是否与broker建立了活动连接。这种方法不具有侵入性，因为它基于内置的Kafka客户端指标。

source: Reactive Messaging invokes user's methods on an I/O thread. Thus, by default, the methods must not block. As described in <<blocking-processing>>, you need to add the `@Blocking` annotation on the method if this method will block the caller thread.
zh_cn: 响应式流会在I/O线程上调用用户的方法。因此在默认情况下，这些方法不能阻塞。正如 link:#blocking-processing[[阻塞处理]] 中所述，如果这个方法会阻塞调用者线程，那么您需要在方法上添加 `@Blocking` 注解。

source: Reactive Messaging invokes your method on an I/O thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you often need to combine Reactive Messaging with blocking processing such as database interactions. For this, you need to use the `@Blocking` annotation indicating that the processing is _blocking_ and should not be run on the caller thread.
zh_cn: Reactive Messaging会在一个I/O线程中调用您的方法。关于这个话题的更多细节，请看 xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] 。但是您可能需要经常将Reactive Messaging 与阻塞式处理相结合使用，比如与数据库通信。为此，您需要使用 `@Blocking` 注解来表该明处理是 _阻塞的_ ，并且不在调用者线程中运行。

source: Reactive MongoDB Client
zh_cn: 响应式MongoDB客户端

source: Reactive Panache Entity
zh_cn: 响应式Panache实体

source: Reactive Resource
zh_cn: 响应式资源

source: Reactive SQL Clients
zh_cn: 响应式SQL客户端

source: Reactive developers may wonder why we can't return a stream of fruits directly. It tends to be a bad idea when dealing with a database. Relational databases do not handle streaming well. It’s a problem of protocols not designed for this use case. So, to stream rows from the database, you need to keep a connection (and sometimes a transaction) open until all the rows are consumed. If you have slow consumers, you break the golden rule of databases: don’t hold connections for too long. Indeed, the number of connections is rather low, and having consumers keeping them for too long will dramatically reduce the concurrency of your application. So, when possible, use a `Uni<List<T>>` and load the content. If you have a large set of results, implement pagination.
zh_cn: 响应式程序开发者可能会想为什么我们不能直接返回水果流。在处理数据库时，这往往不是一个好主意。关系数据库不能很好地处理流。这是协议不是为这个用例设计的问题。因此，要从数据库流输出行，您需要保持一个连接（有时是一个事务）打开，直到所有行都被消耗掉。如果您的用户很慢，那么您就违反了数据库的黄金法则：不要保持连接太长时间。实际上，可用连接的数量相当少，并且让使用者保持这些连接太长时间将极大地降低应用程序的并发性。所以，如果可能的话，使用 `Uni<List<T>>` 并加载内容。如果有大量结果，则实现分页。

source: Reactive extensions
zh_cn: 响应性扩展

source: Read about the community plans for the future. Here is <a href="https://github.com/orgs/quarkusio/projects/5">our current roadmap</a>. This is driven by the community, come and tell us what <i>your</i> needs are.
zh_cn: 阅读有关社区未来的计划。这里是<a href="https://github.com/orgs/quarkusio/projects/5">我们目前的路线图</a>。这是由社区推动的，来告诉我们<i>你</i>的需求是什么。

source: Read only deployment environments
zh_cn: 只读部署环境

source: Read the xref:opentracing.adoc[OpenTracing] guide, for how to configure OpenTracing and how to use the Jaeger tracer.
zh_cn: 阅读 link:opentracing.html[OpenTracing] 指南，了解如何配置OpenTracing以及如何使用Jaeger追踪器。

source: Reading a file and storing the content in memory works for small files, but not big ones. In this section, we will see how you can use Vert.x streaming capability.
zh_cn: 读取文件并将内容存储在内存中适用于小文件，但不适用于大文件。在本节中，我们将带领你了解如何使用 Vert.x 流功能。

source: Reading properties from Spring Cloud Config Server
zh_cn: 从 Spring Cloud 配置服务器中读取配置属性

source: Recap of HTTP based Testing in JVM mode
zh_cn: 对JVM模式中基于HTTP的测试的回顾

source: Receive the messages sent to the `greeting` address
zh_cn: 接收发送到 `greeting` 地址的信息

source: Receives the Vert.x instance as a constructor parameter
zh_cn: 接收Vert.x实例作为构造函数的参数

source: Receiving AMQP messages
zh_cn: 接收AMQP消息

source: Receiving Cloud Events
zh_cn: 接收云事件

source: Receiving Kafka Records in Batches
zh_cn: 批量接收Kafka记录

source: Receiving messages from Kafka
zh_cn: 接收来自Kafka的消息

source: Receiving quotes
zh_cn: 接收报价

source: Reciprocally, multiple producers on the same channel can be merged by setting `mp.messaging.incoming.$channel.merge=true`. On the `@Incoming` methods, you can control how multiple channels are merged using the `@Merge` annotation.
zh_cn: 相应地，同一 channel 上的多个生产者可以通过设置 `mp.messaging.incoming.$channel.merge=true` 来进行合并。在 `@Incoming` 方法上，您可以使用 `@Merge` 来控制多个 channels 的合并方式。

source: Recommended GraalVM version to use.
zh_cn: 推荐使用的GraalVM版本。

source: Red Hat Build of Quarkus
zh_cn: 红帽的Quarkus构建

source: Red Hat OpenShift Streams for Apache Kafka
zh_cn: 红帽OpenShift Streams for Apache Kafka

source: Redis Client
zh_cn: Redis客户端

source: Redpanda is a Kafka compatible event streaming platform. Because it provides a faster startup time dev services defaults to `vectorized/redpanda` images. You can select any version from https://hub.docker.com/r/vectorized/redpanda.
zh_cn: Redpanda是一个兼容Kafka的事件流平台。因为它在dev服务默的 `vectorized/redpanda` 镜像中提供了更快的启动时间。您可以从 https://hub.docker.com/r/vectorized/redpanda 中选择任何版本。

source: Reduction in Reflection Usage
zh_cn: 减少反射的使用

source: Reference Guide
zh_cn: 参考指南

source: Reference guide for SmallRye Reactive Messaging and AMQP.
zh_cn: SmallRye响应式消息传递和AMQP的参考指南。

source: Reference guide for SmallRye Reactive Messaging and RabbitMQ.
zh_cn: SmallRye响应式消息传递和RabbitMQ的参考指南。

source: References
zh_cn: 参考文献

source: Refreshing `JsonWebKey` set for verifying JWT tokens
zh_cn: 刷新 `JsonWebKey` 集以验证JWT tokens

source: Register reflection
zh_cn: 注册反射

source: Register the output of the step executing `./mvnw ...` command (i.e. directory `target/native-image`) as a build artifact,
zh_cn: 将执行 `./mvnw …​` 命令的步骤的输出（即目录 `target/native-image` ）注册为构建工件，

source: Register the output of the step executing the `native-image ...` command (i.e. files matching `target/*runner`) as build artifact.
zh_cn: 将执行 `native-image …​` 命令的步骤的输出（即匹配 `target/*runner` 的文件）注册为构建工件。

source: Registering for reflection
zh_cn: 注册反射

source: Relax the validation of the verification keys, setting this property to `true` will allow public RSA keys with the length less than 2048 bit.
zh_cn: 放宽密钥验证，将此属性设置为 `true` ，将允许长度小于2048比特的公共RSA密钥。

source: Releasing your Quarkus applications with JReleaser
zh_cn: 用JReleaser发布你的Quarkus应用程序

source: Remember, at the beginning of the guide, we added the `smallrye-mutiny-vertx-web-client` dependency to our `pom.xml` file. It's now time to use it.
zh_cn: 请记住，在本指南的开头，我们将 `smallrye-mutiny-vertx-web-client` 作为依赖项添加到了我们的 pom.xml 文件中。现在，是时候使用它了。

source: Remote Development
zh_cn: 远程开发

source: Remove the `src/main/resources/application.properties` and create a `src/main/resources/application.yaml` file.
zh_cn: 删除 `src/main/resources/application.properties` ，并创建一个 `src/main/resources/application.yaml` 文件。

source: Replace `<YOUR.EVENTHUBS.CONNECTION.STRING>` with the connection string for your Event Hubs namespace. For instructions on getting the connection string, see https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-get-connection-string[Get an Event Hubs connection string]. The result would be something like:
zh_cn: 用您的Event Hubs命名空间的连接字符串替换 `<YOUR.EVENTHUBS.CONNECTION.STRING>` 。有关获取连接字符串的说明，请参阅 link:https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-get-connection-string[获取Event Hubs连接字符串] 。结果会类似这样：

source: Replying to messages
zh_cn: 回复信息

source: Report a Vulnerability
zh_cn: 报告漏洞

source: Reporting security issues
zh_cn: 报告安全问题

source: Represent token as `Principal``
zh_cn: 将token表示为 `Principal``

source: Require this artifact in the step executing the `native-image ...` command, and
zh_cn: 在执行 `native-image …​` 命令的步骤中需要这个工件，并且

source: Requires Bearer JWT verification
zh_cn: 需要进行Bearer JWT验证

source: Requires Bearer opaque token verification
zh_cn: 需要进行不透明Bearer token验证

source: Resource
zh_cn: 资源

source: Responses for binary types will be automatically encoded with base64. This is different from the behavior using `quarkus:dev` which will return the raw bytes. Amazon's API has additional restrictions requiring the base64 encoding. In general, client code will automatically handle this encoding but in certain custom situations, you should be aware you may need to manually manage that encoding.
zh_cn: 对二进制类型的响应将会使用base64自动编码。这与使用 `quarkus:dev` 的行为不同，后者将返回原始字节。亚马逊的API有额外的限制，要求base64编码。一般来说，客户端代码会自动处理这种编码，但在某些自定义情况下，你应该知道你可能需要手动管理这种编码。

source: Retrieve a new increment
zh_cn: 查询增量

source: Retrieve the incoming channel (`orders`) - the channel must have been switched to in-memory in the test resource.
zh_cn: 检索传入 channel ( `orders` ) - 该 channel 必须在测试资源中被切换到内存中。

source: Retrieve the outgoing channel (`beverages`) - the channel must have been switched to in-memory in the test resource.
zh_cn: 检索传出 channel ( `beverages` ) - 该 channel 必须在测试资源中被切换到内存中。

source: Retrying message dispatch
zh_cn: 重试消息的发送

source: Retrying processing
zh_cn: 重试处理(Retrying processing)

source: Returns the stream (_Reactive Stream_)
zh_cn: 返回流 (_Reactive Stream_) 。

source: Review automatically generated metrics
zh_cn: 审查自动生成的metrics

source: Roadmap
zh_cn: 路线图

source: Roughly 15 minutes
zh_cn: 大概15分钟

source: Roughly {prerequisites-time}
zh_cn: 大概{prerequisites-time}

source: Run <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">dev mode</a> remotely with changes to local files immediately available in a containerize environment.
zh_cn: 运行远程 <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">开发者模式</a> 可以在容器化环境中立即对本地文件进行更改。

source: Run `act -s GITHUB_TOKEN=<GITHUB_TOKEN>`, where *<GITHUB_TOKEN>* needs to be replaced with a token that allows you to push to the https://github.com/quarkusio/quarkusio.github.io repository.
zh_cn: 运行 `act -s GITHUB_TOKEN=<GITHUB_TOKEN>`，其中 *<GITHUB_TOKEN>* 需要替换为允许您推送到 https://github.com/quarkusio/quarkusio.github.io repository 的令牌。

source: Run the Getting Started Application
zh_cn: 运行 "入门 "应用程序

source: Run the application
zh_cn: 运行应用程序

source: Run the application as a native executable
zh_cn: 以本地可执行文件的方式运行该应用程序

source: Run the application in dev mode with:
zh_cn: 在开发模式下运行该应用程序:

source: Run the application with:
zh_cn: 使用以下命令运行该应用程序:

source: Run the following SAM CLI command to locally test your lambda function, passing the appropriate SAM `template`. The `event` parameter takes any JSON file, in this case the sample `payload.json`.
zh_cn: 运行下面的SAM CLI命令来本地测试你的lambda函数，传递合适的SAM `模板` 。 `event` 参数使用任何JSON文件，在本例中是样本 `payload.json` 。

source: Run the tests to verify that application still functions correctly.
zh_cn: 运行测试以验证应用程序是否仍能正常运行。

source: Run the tests to verify the change.
zh_cn: 运行该测试以验证更改。

source: Run this script in your CLI:
zh_cn: 在你的CLI中运行这个脚本：

source: Runner jar Example
zh_cn: Runner jar的例子

source: Running Native
zh_cn: 以本机可执行文件运行

source: Running `@QuarkusTest` from an IDE
zh_cn: 从IDE中运行 `@QuarkusTest`

source: Running a MongoDB Database
zh_cn: 运行MongoDB数据库

source: Running in JVM or Native mode
zh_cn: 在JVM或本地模式下运行

source: Running it is as simple as executing `./target/mongodb-quickstart-1.0.0-SNAPSHOT-runner`.
zh_cn: 运行它就像执行 `./target/mongodb-quickstart-1.0.0-SNAPSHOT-runner` 一样简单。

source: Running it is as simple as executing `./target/rest-json-quickstart-1.0.0-SNAPSHOT-runner`.
zh_cn: 运行它就像执行 `./target/rest-json-quickstart-1.0.0-SNAPSHOT-runner` 一样简单。

source: Running specific tests
zh_cn: 运行特定的测试

source: Running the Application in Dev mode
zh_cn: 在开发模式下运行应用程序

source: Running the Application in JVM mode
zh_cn: 在JVM模式下运行应用程序

source: Running the Application in Native Mode
zh_cn: 在本地模式下运行应用程序

source: Running the above command should return the result below:
zh_cn: 运行上述命令应返回以下结果：

source: Running the application
zh_cn: 运行应用程序

source: Running the build process in a container is also possible:
zh_cn: 在一个容器中运行构建过程也是可能的：

source: Running this command, should return the following result:
zh_cn: 运行这个命令应返回以下结果：

source: SUBATOMIC<span class="light-blue">/</span>
zh_cn: 亚原子<span class="light-blue">/</span>

source: SUPERSONIC<span class="light-blue">/</span>
zh_cn: 超音速<span class="light-blue">/</span>

source: Sample Dockerfile for building with Gradle:
zh_cn: 用Gradle构建的Docker文件例子：

source: Sample Dockerfile for building with Maven:
zh_cn: 用Maven构建的Docker文件例子：

source: Sample JWT Generation Output
zh_cn: JWT生成输出样本

source: Sample multistage Dockerfile for building an image from `scratch`:
zh_cn: 以下是基于 `scratch` 镜像，使用Dockerfile多阶段构建镜像的例子：

source: Sampler
zh_cn: 采样器(Sampler)

source: Save this file in `src/main/docker/Dockerfile.multistage` as it is not included in the getting started quickstart.
zh_cn: 将此文件保存在 `src/main/docker/Dockerfile.multistage` ，因为它不包括在开始快速入门中。

source: Scheduler
zh_cn: 调度器

source: Scheduling Clustered Tasks with Quartz
zh_cn: 用Quartz调度集群任务

source: Scheduling Periodic Tasks
zh_cn: 安排周期性任务

source: Schema Migration with Flyway
zh_cn: 用Flyway进行模式迁移

source: Schema Migration with Liquibase
zh_cn: 用Liquibase进行模式迁移

source: Scratch image support is experimental.
zh_cn: Scratch镜像的支持是试验性的。

source: Scratch images should not be used in production without rigorous testing.
zh_cn: 在没有经过严格测试的情况下，不应该在生产中使用Scratch镜像。

source: Second, cacerts, the certificate store. You may need to periodically obtain an updated copy, also.
zh_cn: 第二是cacerts，证书库。你可能还需要定期获取更新的副本。

source: Second: Locking in a find().
zh_cn: 第二：通过find()方法使用数据库锁。

source: Secret engines
zh_cn: 秘密引擎

source: SecretKey support
zh_cn: 支持SecretKey

source: Secrets engines are components that store, generate, or encrypt data.
zh_cn: 秘密引擎是存储、生成或加密数据的组件。

source: Secure connections with SSL/TLS
zh_cn: 使用SSL/TLS的安全连接

source: Secure serialization
zh_cn: 安全序列化
